<?php
/*
	[Phpup.Net!] (C)2009-2011 Phpup.net.
	This is NOT a freeware, use is subject to license terms

	$Id: session.class.php 2010-08-24 10:42 $
*/

if(!defined('IN_BIDCMS')) {
	exit('Access Denied');
}
$cate=array("1"=>'新闻阅读',"2"=>'综艺明星',"3"=>'科技数码',"4"=>'生活购物',"5"=>'影音娱乐',"6"=>'社区交友',"7"=>'文化教育',"8"=>'地方政务',"9"=>'公共名人');

$vip=array('0'=>'33','1'=>'1000','2'=>'1666','3'=>'3333','4'=>'5000','5'=>'6666','6'=>'10000');
$month=array('1'=>'30','2'=>'60','3'=>'90','4'=>'120','5'=>'150','6'=>'180','7'=>'210','8'=>'240','9'=>'270','10'=>'300','11'=>'330','12'=>'360');